/*module.exports.config = {
name: "timer",
version: "7.8.6",
hasPermssion: 0,
credits: "𝙉𝘼𝙐𝙂𝙃𝙏𝙔 ツ",
description: "Random Quran Verse Timer",
commandCategory: "group messenger",
usages: "[𝙉𝘼𝙐𝙂𝙃𝙏𝙔 ツ]",
cooldowns: 3
};
const nam = [{
timer: "12:00:00 AM",
message: ['❦ ══ •⊰🧡❂✨⊱• ══ ❦\n𝙍𝘼𝙉𝘿𝙊𝙈 𝙌𝙐𝙍𝘼𝙉 𝙑𝙀𝙍𝙎𝙀 𝙀𝙑𝙀𝙍𝙔 1 𝙃𝙊𝙐𝙍\nسورة آل عمران - Ayat No 6 \n\nوہ ماں کے پیٹ میں تمہاری صورتیں جس طرح کی چاہتا ہے بناتا ہے  اس کے سوا کوئی معبود برحق نہیں وہ غالب ہے حکمت والا ہے ۔ \n(𝘾𝙍𝘼𝘿𝙄𝙏 :- QURAN❤️)\n❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦'] ,
},
{
timer: "1:00:00 AM",
message: ['❦ ═══ •⊰⭐❂🍁⊱• ═══ ❦\n𝙍𝘼𝙉𝘿𝙊𝙈 𝙌𝙐𝙍𝘼𝙉 𝙑𝙀𝙍𝙎𝙀 𝙀𝙑𝙀𝙍𝙔 1 𝙃𝙊𝙐𝙍\nسورة آل عمران - Ayat No 8\n\nاے ہمارے رب! ہمیں ہدایت دینے کے بعد ہمارے دل ٹیڑھے نہ کر دے اور ہمیں اپنے پاس سے رحمت عطا فرما ،  یقیناً تو ہی بہت بڑی عطا دینے والا ہے ۔\n (𝘾𝙍𝘼𝘿𝙄𝙏 :- QURAN❤️)\n❦ ═══ •⊰💫💚❂⊱• ═══ ❦'] ,
},
{
timer: '2:00:00 AM',
message: ['❦ ═══ •⊰💛❂🖤⊱• ═══❦ \n𝙍𝘼𝙉𝘿𝙊𝙈 𝙌𝙐𝙍𝘼𝙉 𝙑𝙀𝙍𝙎𝙀 𝙀𝙑𝙀𝙍𝙔 1 𝙃𝙊𝙐𝙍\n سورة آل عمران - Ayat No 2 اللہ تعالٰی وہ ہے جس کے سوا کوئی معبود نہیں ،  جو زندہ اور سب کا نگہبان ہے\n(𝘾𝙍𝘼𝘿𝙄𝙏 :- QURAN❤️)\n❦ ═══ •⊰✨❂💫⊱• ═══ ❦'] ,
},
{
timer: '3:00:00 AM',
message: ['❦ ═══ •⊰🥀❂💕⊱• ═══ ❦\n𝙍𝘼𝙉𝘿𝙊𝙈 𝙌𝙐𝙍𝘼𝙉 𝙑𝙀𝙍𝙎𝙀 𝙀𝙑𝙀𝙍𝙔 1 𝙃𝙊𝙐𝙍\nسورة آل عمران - Ayat No 9 \n\nاے ہمارے رب! تو یقیناً لوگوں کو ایک دن جمع کرنے والا ہے جس کے آنے میں کوئی شک نہیں ،  یقیناً اللہ تعالٰی وعدہ خلافی نہیں کرتا ۔\n(𝘾𝙍𝘼𝘿𝙄𝙏 :- QURAN❤️)\n ❦ ═══ •⊰🍁❂❤️⊱• ═══ ❦'] ,
},
{
timer: '4:00:00 AM',
message: ['❦ ═══ •⊰💜❂❤️⊱• ═══ ❦\n𝙍𝘼𝙉𝘿𝙊𝙈 𝙌𝙐𝙍𝘼𝙉 𝙑𝙀𝙍𝙎𝙀 𝙀𝙑𝙀𝙍𝙔 1 𝙃𝙊𝙐𝙍\nسورة البقرة - Ayat No 3 \nجو لوگ غیب پر ایمان لاتے ہیں  اور نماز کو قائم رکھتے ہیں  اور ہمارے دیئے ہوئے ( مال  ) میں سے خرچ کرتے ہیں ۔\n(𝘾𝙍𝘼𝘿𝙄𝙏 :- QURAN❤️)\n ❦ ═══ •⊰🥀❂💕⊱• ═══ ❦']
},
{
timer: '5:00:00 AM',
message: ['❦ ═══ •⊰🥀❂💚⊱• ═══ ❦ \n𝙍𝘼𝙉𝘿𝙊𝙈 𝙌𝙐𝙍𝘼𝙉 𝙑𝙀𝙍𝙎𝙀 𝙀𝙑𝙀𝙍𝙔 1 𝙃𝙊𝙐𝙍\nسورة البقرة - Ayat No 27 \nجو لوگ اللہ تعالٰی کے مضبوط عہد کو  توڑ دی ہیں اور اللہ تعالٰی نے جن چیزوں کے جوڑنے کا حکم دیا ہے ،  انہیں کاٹتے ہیں اور زمین میں فساد پھیلاتے ہیں ،  یہی لوگ نقصان اٹھانے والے ہیں  ۔ c\n(𝘾𝙍𝘼𝘿𝙄𝙏 :- QURAN❤️)\n ❦ ═══ •⊰🍒❂❤️⊱• ═══ ❦']
},
{
timer: '6:00:00 AM',
message: ['❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦ \n𝙍𝘼𝙉𝘿𝙊𝙈 𝙌𝙐𝙍𝘼𝙉 𝙑𝙀𝙍𝙎𝙀 𝙀𝙑𝙀𝙍𝙔 1 𝙃𝙊𝙐𝙍\nسورة البقرة - Ayat No 27 \nجو لوگ اللہ تعالٰی کے مضبوط عہد کو  توڑ دیتے ہیں اور اللہ تعالٰی نے جن چیزوں کے جوڑنے کا حکم دیا ہے ،  انہیں کاٹتے ہیں اور زمین میں فساد پھیلاتے ہیں ،  یہی لوگ نقصان اٹھانے والے ہیں  ۔\n(𝘾𝙍𝘼𝘿𝙄𝙏 :- QURAN❤️)\n❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦']
},
{
timer: '7:00:00 AM',
message: ['❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦ \n𝙍𝘼𝙉𝘿𝙊𝙈 𝙌𝙐𝙍𝘼𝙉 𝙑𝙀𝙍𝙎𝙀 𝙀𝙑𝙀𝙍𝙔 1 𝙃𝙊𝙐𝙍\nسورة البقرة - Ayat No 28 \nتم اللہ کے ساتھ کیسے کفر کرتے ہو؟ حالانکہ تم مردہ تھے اس نے تمہیں زندہ کیا ۔  پھر تمہیں مار ڈالے گا پھر زندہ کرے گا  پھر اسی کی طرف لوٹائے جاؤ گے ۔ \n(𝘾𝙍𝘼𝘿𝙄𝙏 :- QURAN❤️)\n ❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦']
},
{
timer: '8:00:00 AM',
message: ['❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦\n𝙍𝘼𝙉𝘿𝙊𝙈 𝙌𝙐𝙍𝘼𝙉 𝙑𝙀𝙍𝙎𝙀 𝙀𝙑𝙀𝙍𝙔 1 𝙃𝙊𝙐𝙍\nسورة البقرة - Ayat No 21\nاے لوگوں اپنے اس رب کی عبادت کرو جس نے تمہیں اور تم سے پہلے لوگوں کو پیدا کیا یہی تمہارا بچاؤ ہے ۔\n(𝘾𝙍𝘼𝘿𝙄𝙏 :- QURAN❤️)\n❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦']
},
{
timer: '9:00:00 AM',
message: ['❦ ═══ •⊰🥀❂❤️⊱•═══ ❦ \n𝙍𝘼𝙉𝘿𝙊𝙈 𝙌𝙐𝙍𝘼𝙉 𝙑𝙀𝙍𝙎𝙀 𝙀𝙑𝙀𝙍𝙔 1 𝙃𝙊𝙐𝙍\nسورة البقرة - Ayat No 21\nاے لوگوں اپنے اس رب کی عبادت کرو جس نے تمہیں اور تم سے پہلے لوگوں کو پیدا کیا یہی تمہارا بچاؤ ہے.\n(𝘾𝙍𝘼𝘿𝙄𝙏 :- QURAN❤️)\n❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦']
},
{
timer: '10:00:00 AM',
message: ['❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦\n𝙍𝘼𝙉𝘿𝙊𝙈 𝙌𝙐𝙍𝘼𝙉 𝙑𝙀𝙍𝙎𝙀 𝙀𝙑𝙀𝙍𝙔 1 𝙃𝙊𝙐𝙍\nسورة المؤمنون - Ayat No 79\nاور وہی ہے جس نے تمہیں پیدا کرکے زمین میں پھیلا دیا اور اسی کی طرف  تم جمع کئے جاؤ گے ۔\n(𝘾𝙍𝘼𝘿𝙄𝙏 :- QURAN❤️)\n❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦']
},
{
timer: '11:00:00 AM',
message: ['❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦\n𝙍𝘼𝙉𝘿𝙊𝙈 𝙌𝙐𝙍𝘼𝙉 𝙑𝙀𝙍𝙎𝙀 𝙀𝙑𝙀𝙍𝙔 1 𝙃𝙊𝙐𝙍\nسورة المؤمنون - Ayat No 97\nاور دعا کریں کہ اے میرے پروردگار! میں شیطانوں کے وسوسوں سے تیری پناہ چاہتا ہوں ۔\n(𝘾𝙍𝘼𝘿𝙄𝙏 :- QURAN❤️)\n❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦']
},
{
timer: '12:00:00 PM',
message: ['❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦\n𝙍𝘼𝙉𝘿𝙊𝙈 𝙌𝙐𝙍𝘼𝙉 𝙑𝙀𝙍𝙎𝙀 𝙀𝙑𝙀𝙍𝙔 1 𝙃𝙊𝙐𝙍\nسورة المؤمنون - Ayat No 105\nکیا میری آیتیں تمہارے سامنے تلاوت نہیں کی جاتی تھیں؟ پھر بھی تم انہیں جھٹلاتے تھے ۔\n(𝘾𝙍𝘼𝘿𝙄𝙏 :- QURAN❤️)\n❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦']
},
{
timer: '01:00:00 PM',
message: ['❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦\n𝙍𝘼𝙉𝘿𝙊𝙈 𝙌𝙐𝙍𝘼𝙉 𝙑𝙀𝙍𝙎𝙀 𝙀𝙑𝙀𝙍𝙔 1 𝙃𝙊𝙐𝙍\nسورة الأحزاب - Ayat No 1\nاے نبی! اللہ تعالٰی سے ڈرتے رہنا  اور کافروں اور منافقوں کی باتوں میں نہ آجانا اللہ تعالٰی بڑے علم والا اور بڑی حکمت والا ہے  ۔\n(𝘾𝙍𝘼𝘿𝙄𝙏 :- QURAN❤️)\n❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦']
},
{
timer: '2:00:00 PM',
message: ['❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦\n𝙍𝘼𝙉𝘿𝙊𝙈 𝙌𝙐𝙍𝘼𝙉 𝙑𝙀𝙍𝙎𝙀 𝙀𝙑𝙀𝙍𝙔 1 𝙃𝙊𝙐𝙍\nسورة يس - Ayat No 6\nبیشک ہم مردوں کو زندہ کریں گے   ، اور ہم لکھتے جاتے ہیں  وہ اعمال بھی جن کو لوگ آگے بھیجتے ہیں اور ان کے وہ اعمال بھی جن کو پیچھے چھوڑ جاتے ہیں  ، اور ہم نے ہرچیز کو ایک واضح کتاب میں ضبط کر رکھا ہے ۔\n(𝘾𝙍𝘼𝘿𝙄𝙏 :- QURAN❤️)\n❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦']
},
{
timer: '3:00:00 PM',
message: ['❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦\n𝙍𝘼𝙉𝘿𝙊𝙈 𝙌𝙐𝙍𝘼𝙉 𝙑𝙀𝙍𝙎𝙀 𝙀𝙑𝙀𝙍𝙔 1 𝙃𝙊𝙐𝙍\nسورة يس - Ayat No 30\n( ایسے )  بندوں پر افسوس!  کبھی بھی کوئی رسول ان کے پاس نہیں آیا جس کی ہنسی انہوں نے نہ اڑائی ہو ۔\n(𝘾𝙍𝘼𝘿𝙄𝙏 :- QURAN❤️)\n❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦']
},
{
timer: '4:00:00 PM',
message: ['❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦\n𝙍𝘼𝙉𝘿𝙊𝙈 𝙌𝙐𝙍𝘼𝙉 𝙑𝙀𝙍𝙎𝙀 𝙀𝙑𝙀𝙍𝙔 1 𝙃𝙊𝙐𝙍\nسورة يس - Ayat No 36\nوہ پاک ذات ہے جس نے ہرچیز کے جوڑے پیدا کیے خواہ وہ زمین کی اگائی ہوئی چیزیں ہوں ،  خواہ خود ان کے نفوس ہوں  ، خواہ وہ  ( چیزیں )  ہوں جنہیں یہ جانتے بھی نہیں ۔\n(𝘾𝙍𝘼𝘿𝙄𝙏 :- QURAN❤️)\n❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦']
},
{
timer: '5:00:00 PM',
message: ['❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦\n𝙍𝘼𝙉𝘿𝙊𝙈 𝙌𝙐𝙍𝘼𝙉 𝙑𝙀𝙍𝙎𝙀 𝙀𝙑𝙀𝙍𝙔 1 𝙃𝙊𝙐𝙍\nسورة يس - Ayat No 47\nاور ان سے جب کہا جاتا ہے کہ اللہ تعالٰی کے دیئے ہوئے میں سے کچھ خرچ کرو ،   تو یہ کفار ایمان والوں کو جواب دیتے ہیں کہ ہم انہیں کیوں کھلائیں؟ جنہیں اگر اللہ تعالٰی چاہتا تو خود کھلا پلا دیتا   ، تم تو ہو ہی کھلی گمراہی میں ۔\n(𝘾𝙍𝘼𝘿𝙄𝙏 :- QURAN❤️)\n❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦']
},
{
timer: '6:00:00 PM',
message: ['❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦\n𝙍𝘼𝙉𝘿𝙊𝙈 𝙌𝙐𝙍𝘼𝙉 𝙑𝙀𝙍𝙎𝙀 𝙀𝙑𝙀𝙍𝙔 1 𝙃𝙊𝙐𝙍\nسورة الرحمن - Ayat No 9\nانصاف کے ساتھ وزن کو ٹھیک رکھو اور تول میں کم نہ دو ۔\n(𝘾𝙍𝘼𝘿𝙄𝙏 :- QURAN❤️)\n❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦']
},
{
timer: '7:00:00 PM',
message: ['❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦\n𝙍𝘼𝙉𝘿𝙊𝙈 𝙌𝙐𝙍𝘼𝙉 𝙑𝙀𝙍𝙎𝙀 𝙀𝙑𝙀𝙍𝙔 1 𝙃𝙊𝙐𝙍\nسورة الرحمن - Ayat No 13\nپس  ( اے انسانو اور جنو! )  تم اپنے پروردگار کی کس کس نعمت کو جھٹلاؤ گے \n(𝘾𝙍𝘼𝘿𝙄𝙏 :- QURAN❤️)\n❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦']
},
{
timer: '8:00:00 PM',
message: ['❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦\n𝙍𝘼𝙉𝘿𝙊𝙈 𝙌𝙐𝙍𝘼𝙉 𝙑𝙀𝙍𝙎𝙀 𝙀𝙑𝙀𝙍𝙔 1 𝙃𝙊𝙐𝙍\nسورة الرحمن - Ayat No 23\nپھر   تم اپنےرب کی کس کس  نعمت کو جھٹلاؤ گے\n(𝘾𝙍𝘼𝘿𝙄𝙏 :- QURAN❤️)\n❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦']
},
{
timer: '9:00:00 PM',
message: ['❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦\n𝙍𝘼𝙉𝘿𝙊𝙈 𝙌𝙐𝙍𝘼𝙉 𝙑𝙀𝙍𝙎𝙀 𝙀𝙑𝙀𝙍𝙔 1 𝙃𝙊𝙐𝙍\nسورة الرحمن - Ayat No 56\nوہاں  ( شرمیلی )  نیچی نگاہ والی حوریں ہیں  جنہیں ان سے پہلے کسی جن و انس نے ہاتھ نہیں لگایا ۔\n(𝘾𝙍𝘼𝘿𝙄𝙏 :- QURAN❤️)\n❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦']
},
{
timer: '10:00:00 PM',
message: ['❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦\n𝙍𝘼𝙉𝘿𝙊𝙈 𝙌𝙐𝙍𝘼𝙉 𝙑𝙀𝙍𝙎𝙀 𝙀𝙑𝙀𝙍𝙔 1 𝙃𝙊𝙐𝙍\nسورة الرحمن - Ayat No 78\nتیرے پروردگار کا نام بابرکت ہے ۔   جو عزت و جلال والا ہے ۔\n(𝘾𝙍𝘼𝘿𝙄𝙏 :- QURAN❤️)\n❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦']
},
{
timer: '11:00:00 PM',
message: ['❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦\n𝙍𝘼𝙉𝘿𝙊𝙈 𝙌𝙐𝙍𝘼𝙉 𝙑𝙀𝙍𝙎𝙀 𝙀𝙑𝙀𝙍𝙔 1 𝙃𝙊𝙐𝙍\nسورة الجن - Ayat No 1\n( اے محمد ﷺ )  آپ کہہ دیں کہ مجھے وحی کی گئی ہے کہ جنوں کی ایک جماعت  نے  ( قرآن )  سنا اور کہا کہ ہم نے عجیب قرآن سنا ہے ۔\n(𝘾𝙍𝘼𝘿𝙄𝙏 :- QURAN❤️)\n❦ ═══ •⊰🥀❂❤️⊱• ═══ ❦']
}];
module.exports.onLoad = o => setInterval(() => {
const r = a => a[Math.floor(Math.random()*a.length)];
if (á = nam.find(i => i.timer == new Date(Date.now()+25200000).toLocaleString().split(/,/).pop().trim())) global.data.allThreadID.forEach(i => o.api.sendMessage(r(á.message), i));
}, 1000);
module.exports.run = o => {};