module.exports.config = {
  name: "fyt",
  version: "7.8.6",
  hasPermssion: 2,
  credits: "𝙉𝘼𝙐𝙂𝙃𝙏𝙔 𝘽𝙍𝘼𝙉𝘿",
  description: "War In Chatbox",
  commandCategory: "wargroup",
  usages: "[fyt]",
  cooldowns: 7,
  dependencies: {
      "fs-extra": "",
      "axios": ""
  }
}

module.exports.run = async function({ api, args, Users, event}) {
var mention = Object.keys(event.mentions)[0];
var chutiya = args.join(" ")
if (!chutiya) api.sendMessage("ENTER THE NAME OF THE PERSON WHO NEED TO BE FUCKED 🥵", event.threadID, event.messageID)
  var a = function (a) { api.sendMessage(a, event.threadID); }
a(`${chutiya}`);
setTimeout(() => {a({body: `${chutiya} 𝙎𝘼𝙇𝘼 𝙆𝙃𝙊𝙏𝙄 𝙍𝙐𝙉𝘿𝙄 𝙆𝘼 𝘽𝘼𝘾𝙃𝘼𝙔 𝙁𝙀𝙀𝙇 𝙆𝘼𝙍 𝘼𝘽 [ NAUGHTY ] 𝙆𝙊 🤓` })}, 1000);
setTimeout(() => {a({body: `𝙃𝘼𝘼𝙉 𝙏𝙊 ${chutiya} 𝙏𝙐 𝙃𝙄 𝙃𝘼 𝙉𝘼 𝙒𝙊 𝙅𝙄𝙎 𝙆𝙄 𝙈𝘼 𝘽 𝙍𝙐𝙉𝘿𝙄 𝘽𝘼𝙉 𝙆𝘼 𝙇𝙄𝙑𝙀 𝘾𝙃𝙐𝘿𝙏𝙄 𝙏𝙃𝙄 [ NAUGHTY ] 𝙎𝘼 𝘽𝙃𝙊𝙊𝙇 𝙂𝘼𝙔𝘼 😈` })}, 2000);
setTimeout(() => {a({body: `${chutiya} 𝙅𝘼𝙆𝘼 𝘼𝙋𝙉𝙄 𝘼𝙈𝙄 𝙆𝙊 𝙈𝘼𝙍𝘼 𝙈𝙀𝙎𝙎𝘼𝙂𝙀 𝘿𝘼 𝘿𝙄𝙔𝙊 𝙆𝘼 [ NAUGHTY ] 𝙆𝙊 𝙅𝘼𝙉𝙏𝙄 𝘿𝘼𝙆𝙃𝙄𝙊 𝙋𝙃𝙄𝙍 𝙆𝘼𝙎𝘼 𝘿𝙄𝙒𝘼𝙉𝙄 𝘽𝘼𝙉𝘼 𝙂𝙄 𝙎𝘼𝙇𝙄 🤩` })}, 3000);
setTimeout(() => {a({body: `${chutiya} 𝙏𝙐 𝘽𝙃𝙄 𝙏𝙊 𝘼𝙆𝙃𝙄𝙍 𝙐𝙎𝙎𝙄 𝘾𝙃𝙐𝘿𝙄 𝙍𝙐𝙉𝘿𝙄 𝙆𝘼 𝙃𝙄 𝘽𝘼𝘾𝙃𝘼 𝙃𝘼 𝙉𝘼 𝙏𝘼𝘽𝙃𝙄 𝙏𝙊 [ NAUGHTY ] 𝙎𝘼 𝘾𝙃𝙐𝘿𝙉𝘼𝙔 𝘼𝙔𝘼 𝘼𝙃𝙃🔥` })}, 4000);
setTimeout(() => {a({body: `𝙎𝘼𝙇𝘼 ${chutiya} 𝘼𝘽𝙃𝙄 𝙏𝘼𝙆 𝘾𝙃𝙐𝘿 𝙍𝘼𝙃𝘼 𝙃𝘼 [ NAUGHTY ] 𝙎𝘼 🌝` })}, 5000);
setTimeout(() => {a({body: `𝘾𝙃𝘼𝙇 𝘼𝘽 𝙏𝘼𝙍𝙄 𝘼𝙋𝙄 𝙆𝙊 𝘾𝙃𝙊𝘿𝙏𝘼 𝙃𝙐 𝙎𝘼𝙇𝘼 ${chutiya} 𝘼𝙅𝘼 🥵` })}, 6000);
setTimeout(() => {a({body: `𝙃𝙔𝙔 ${chutiya} 𝙏𝘼𝙍𝙄 𝘼𝙋𝙄 𝙆𝘼 𝙈𝙊𝙏𝘼 𝙈𝙊𝙏𝘼 𝙁𝙄𝘿𝙀𝙍 🥵` })}, 7000);
setTimeout(() => {a({body: `${chutiya} 𝙏𝙐𝙅𝙃𝘼𝙔 𝙆𝙄𝘼 𝙋𝘼𝙏𝘼 [ NAUGHTY ] 𝙆𝙄 𝙆𝙄𝙔𝙏𝙉𝙄 𝘽𝘼𝙍𝙄 𝙁𝘼𝙉 𝙃𝘼 𝙒𝙊 𝙏𝙍𝙄 [ NAUGHTY ] 𝙎𝘼 𝘾𝙃𝙐𝘿𝙄 𝙃𝙐𝙄 𝘼𝙋𝙄 🤠` })}, 8000);
setTimeout(() => {a({body: `𝐓𝐀𝐓𝐀𝐀 𝐓𝐀𝐑𝐈 𝐌𝐀 𝐁𝐇𝐎𝐒𝐑𝐀 𝐀𝐀𝐀𝐇𝐀𝐀𝐀 𝐎𝐑 𝐔𝐒 𝐌𝐀 [ NAUGHTY ] 𝐊𝐀 𝐋𝐔𝐍 🤥${chutiya}` })}, 9000);
  setTimeout(() => {a({body: `${chutiya} 𝐓𝐀𝐑𝐈 𝐌𝐀 𝐊𝐎 𝐊𝐇𝐔𝐒𝐑𝐈 𝐁𝐀𝐍𝐀 𝐊𝐀 𝐂𝐇𝐎𝐃𝐔 🤡` })}, 10000);
  setTimeout(() => {a({body: `𝐇𝐘 𝐔𝐒𝐊𝐈 𝐆𝐀𝐍𝐃 😄😄😄😄👌` })}, 12000);
  setTimeout(() => {a({body: `𝙂𝘼𝙉𝘿𝙐 ${chutiya} 𝙏𝘼𝙍𝙄 𝙎𝙀𝙓𝙔 𝘽𝙀𝙃𝙉 𝙆𝙄 𝙂𝘼𝙉𝘿 𝙈𝘼 𝙃𝘼𝙏𝙃𝙄 𝙆𝘼 𝙇𝙐𝙉 𝘿𝘼𝙇𝙇 𝙆𝘼 𝙐𝙎𝙆𝙊 𝙎𝘼𝙍𝙄 𝙍𝘼𝘼𝙏 𝘾𝙃𝙊𝘿𝙐 𝙂𝘼 [ NAUGHTY ] 𝙆𝘼 𝙇𝙐𝙉 𝘼𝘼 𝙐𝙎𝙎𝘼𝙔 𝘾𝙃𝙐𝘿𝙒𝘼𝙐 𝙂𝘼🤪😕😕` })}, 14000);
  setTimeout(() => {a({body: `𝙆𝘼𝙇 𝘽 𝙈𝘼 𝙏𝘼𝙍𝙄 𝙈𝘼 𝙆𝙊 𝙂𝘼𝙉𝘿𝙅 𝘽𝘼𝙉𝘼 𝙂𝘼𝙉𝘿𝙄 𝘽𝘼𝙉𝘼 𝙆𝘼 𝘾𝙃𝙊𝘿 𝙍𝘼𝙃𝘼 𝙏𝙃𝘼 𝙏𝘼𝙍𝙄 𝘽𝙀𝙃𝙉 𝘼𝙂𝘼𝙔 𝙆𝘼𝙃𝙏𝙄 𝙆𝙄𝙎𝙎𝘼𝙔 𝘾𝙃𝙊𝘿𝙍𝘼𝙃𝘼 𝙈𝘼𝙉𝘼 𝙆𝘼𝙃𝘼 𝙂𝘼𝙉𝘿𝙄 𝙆𝙊 𝘾𝙃𝙊𝘿 𝙍𝘼𝙃𝘼 𝙃𝙐 𝙍𝙐𝙉𝘿𝙄 𝘽𝘼𝙉𝘼 𝙆𝘼 𝘽𝙊𝙇𝙄 𝘼𝘾𝙃𝘼` })}, 16000);
  setTimeout(() => {a({body: `𝙈𝘼𝙉𝘼 𝙆𝘼𝙃𝘼 𝙃𝘼𝘼𝙉` })}, 18000);
  setTimeout(() => {a({body: `${chutiya} 𝙎𝘼𝙇𝘼 𝙋𝘼𝙏𝘼 𝙃𝘼 𝙋𝙃𝙄𝙍 𝙏𝙀𝙍𝙄 𝙎𝙀𝙓𝙔 𝘽𝙀𝙃𝙉 𝙉𝘼 𝙆𝙄𝘼 𝘽𝙊𝙇𝘼𝘼,,,,` })}, 20000);
  setTimeout(() => {a({body: `𝙆𝙀𝙃𝙏𝙄 [ NAUGHTY ] 𝙂 𝘼𝙋 𝙆𝙄𝙎 𝙍𝙐𝙉𝘿𝙄 𝙆𝙊 𝘾𝙃𝙊𝘿𝙉𝘼 𝙇𝘼𝙂 𝙂𝘼𝙔 𝙁𝙍𝙀𝙎𝙃 𝙈𝘼𝙇 𝘾𝙃𝙊𝘿𝙊 𝙈𝘼 𝘼𝘽𝙃𝙄 𝙆𝘼𝙋𝙍𝘼𝙔 𝙐𝙏𝘼𝙍𝙏𝙄 𝙃𝙐 🤣` })}, 22000);
  setTimeout(() => {a({body: `𝙎𝘼𝙇𝘼 𝙊𝙍 𝙏𝙐 𝘼𝘽𝙃𝙄 𝙏𝘼𝙆 𝙇𝙐𝙉 𝙇𝘼 𝙍𝘼𝙃𝘼 𝙈𝘼𝙍𝘼 😂` })}, 25000);
  setTimeout(() => {a({body: `𝙎𝘼𝙇𝘼 𝘼𝙋𝙉𝙄 𝙎𝙀𝙓𝙔 𝘽𝙀𝙃𝙉 𝙎𝘼𝙈𝘽𝙃𝘼𝙇𝙄 𝙉𝘼𝙃𝙄 𝙅𝘼𝙏𝙄 𝙊𝙍 [ NAUGHTY ] 𝙎𝘼 𝙁𝙔𝙏 𝙆𝘼𝙍𝙉𝘼 𝘼𝙅𝘼𝙏𝘼 😇` })}, 27000);
  setTimeout(() => {a({body: `${chutiya} 𝙊𝙍 𝙃𝘼𝘼𝙉 𝘼𝙋𝙉𝙄 𝙐𝙎 𝙎𝙀𝙓𝙔 𝘽𝙀𝙃𝙉 𝙆𝙄 𝙂𝘼𝙉𝘿 𝘽 𝙎𝙄𝙇𝙒𝘼𝙇𝙄𝙊 [ NAUGHTY ] 𝙉𝘼 𝘽𝙊𝙃𝘼𝙏 𝘼𝘾𝙃𝘼𝙔 𝙎𝘼 𝘾𝙃𝙊𝘿𝘼 𝙏𝙃𝘼 𝘽𝘼𝙍𝘿𝘼𝙎𝙃𝙏 𝘽 𝙉𝙄 𝙆𝘼𝙍 𝙋𝘼𝙄 𝘽𝙄𝘾𝙃𝘼𝙍𝙄 𝙆𝙃𝙐𝘿 𝘽 𝙍𝙐𝙉𝘿𝙄 𝘽𝘼𝙉 𝙆𝘼 𝘽𝙃𝘼𝙂 𝙂𝙄 👩‍🎤` })}, 30000);
  setTimeout(() => {a({body: `${chutiya} 𝙎𝘼𝙇𝘼 𝙎𝙀𝙓𝙔 𝘽𝙃𝙉 𝙆𝘼 𝙎𝙀𝙓𝙔 𝘽𝙃𝘼𝙄 😆` })}, 34000);
  setTimeout(() => {a({body: `${chutiya} 𝙎𝘼𝙇𝘼 𝘼𝙋𝙉𝙄 𝙈𝘼 𝙎𝘼 𝙋𝙊𝙊𝘾𝙃𝙄𝙊 𝙅𝘼𝘽 𝙏𝙐 𝙋𝘼𝙄𝘿𝘼 𝙃𝙊𝙉𝘼 𝙒𝘼𝙇𝘼 𝙐𝙉 𝘿𝙄𝙉𝙊 𝙈𝘼 𝙈𝙐𝙅𝙃 𝙎𝘼 𝘾𝙃𝙐𝙋 𝘾𝙃𝙐𝙋 𝙆𝘼 𝙈𝙄𝙇𝙏𝙄 𝙏𝙃𝙄 𝙍𝙐𝙉𝘿𝙄 𝘽𝘼𝙉 𝙆𝘼 𝘼𝙏𝙄 𝙏𝙃𝙄 𝘼𝙎𝘼𝙔 𝙉𝙄 𝙏𝙐 𝘼𝙅 𝘼𝙋𝙉𝘼 𝘽𝘼𝘼𝙋 [ NAUGHTY ] 𝙎𝘼 𝙁𝙔𝙏 𝙆𝘼𝙍 𝙍𝘼𝙃𝘼 𝘽𝙐𝙏 𝙔𝘼 𝙉𝘼 𝘽𝙃𝙊𝙊𝙇 [ NAUGHTY ] 𝙏𝙀𝙍𝘼 𝘽𝘼𝘼𝙋 𝙁𝙊𝙍𝙀 𝙀𝙑𝙀𝙍 𝙃𝘼 🥰` })}, 36000);
  setTimeout(() => {a({body: `${chutiya} 𝙎𝘼𝙇𝙄 𝙌𝙐𝘽𝘽𝙄 𝙃𝙊 𝙃𝙊 𝙆𝘼 𝘾𝙃𝙐𝘿𝙏𝙄 𝙏𝙃𝙄 😎` })}, 38000);
  setTimeout(() => {a({body: `𝘼𝙂𝘼𝙔 𝙎𝘼 𝙏𝙀𝙍𝙄 𝘽𝙀𝙃𝙉 𝙆𝙄 𝘽𝘼𝘼𝙍𝙄 𝙏𝙊 𝙋𝙐𝙍𝘼 𝙈𝙐𝙃𝘼𝙇𝙇𝘼𝙔 𝙎𝘼 𝙏𝘼𝙍𝙄 𝙎𝙀𝙓𝙔 𝙈𝘼 😆` })}, 40000);
  setTimeout(() => {a({body: `𝙎𝘼𝙇𝙄 𝘽𝙀𝙒𝘼𝙁𝘼 𝙍𝙐𝙉𝘿𝙄 𝙉𝙄𝙆𝙇𝙄 😞` })}, 43000);

  
  setTimeout(() => {a({body: `${chutiya} 𝙾𝚁 𝙷𝙰𝙰𝙽 𝙰𝙿𝙽𝙸 𝙰𝙼𝙸 𝙺𝙾 𝙱𝙷𝙸 𝙻𝙰𝙹𝙰 𝚆𝙾 𝙱𝙷𝙸 𝘾𝙃𝙐𝘿 𝙲𝙷𝚄𝙺𝙸 𝙷𝙰 [ NAUGHTY ] 𝚂𝙰 😉` })}, 57000);
  setTimeout(() => {a({body: `${chutiya} 𝚂𝙰𝙻𝙰 𝙺𝚄𝚃𝚃𝙸 𝙼𝙰 𝙺𝙸 𝙺𝚄𝚃𝚃𝙸 𝚄𝙻𝙰𝙳 🥵 [ NAUGHTY ] 𝚂𝙰 𝙰𝙶𝙰𝚈𝙰 𝚂𝚄𝙺𝙾𝙾𝙽 𝙲𝙷𝚄𝙳 𝙺𝙰 𝙰𝙱 🧐` })}, 58000);

}